// Задача 10: Напишите программу, которая принимает на
// вход трёхзначное число и на выходе показывает вторую
// цифру этого числа.


Console.WriteLine("Введите число от 100 до 999:");

int num = Convert.ToInt32(Console.ReadLine());

int SecondNum = (int number)
